0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    TOP      
    {
	type freestream;
	freestreamValue uniform (0 0 0);
    }

    BOT      
    {
        type freestream;
        freestreamValue uniform (0 0 0);
    }

    PLANE      
    {
        type            testFixedValue;
        refValue        uniform (0 0 1);
        value           uniform (0 0 1);
        offset          (0 0 0);
        amplitude       2.5E-3;
        frequency       0.08;
    }

    LEFT      
    {
        type freestream;
        freestreamValue uniform (0 0 0);
    }

    RIGHT      
    {
        type freestream;
        freestreamValue uniform (0 0 0);
    }

    SYMM    
    {
        type            empty;
    }
}

// ************************************************************************* //
