0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1.0e+5;

boundaryField
{
    TOP      
    {
        type            freestreamPressure;
    }

    BOT      
    {
        type            freestreamPressure;
    }

    LEFT
    {
        type            freestreamPressure;
    }

    RIGHT      
    {
        type            freestreamPressure;
    }

    PLANE      
    {
        type            zeroGradient;
    }

    SYMM    
    {
        type            empty;
    }
}

// ************************************************************************* //
