constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

nu              nu [ 0 2 -1 0 0 0 0 ] 1.0e-6;

DS              DS [ 0 2 -1 0 0 0 0 ] 1.41e-09;

g		g [ 0 1 -2 0 0 0 0 ] (0 0 -9.81);

Lambda		Lambda [ 0 1 0 0 0 0 0 ] 20.0;

dens0		dens0 [ 0 0 0 0 0 0 0 ] 1000;

// ************************************************************************* //
